package waed.dev.adminhoria.screens.news;

import android.content.Intent;
import android.os.Bundle;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;

import java.util.ArrayList;

import waed.dev.adminhoria.adapters.NewsAdapter;
import waed.dev.adminhoria.models.News;
import waed.dev.adminhoria.R;
import waed.dev.adminhoria.databinding.ActivityNewsBinding;

public class NewsActivity extends AppCompatActivity {
    private ActivityNewsBinding binding;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        binding = ActivityNewsBinding.inflate(getLayoutInflater());
        setContentView(binding.getRoot());
        // Listeners and adapter
        init();
    }

    private void init() {
        // setup the Listener
        setupListeners();
        // setup the adapter with data
        setupNewsAdapter(createDummyData());
    }

    private ArrayList<News> createDummyData() {
        ArrayList<News> models = new ArrayList<>();
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        models.add(new News("adslfjasdf", R.drawable.news_example_image, "ماذا حدث في ال17 من نسيان ؟", "يوم الأسير الفلسطيني هو يوم تضامني مع الأسرى الفلسطينيين في السجون والمعتقلات الإسرائيلية، ويوافق 17 نيسان/أبريل من كُل عام.\\n\\nفي عام 1974 أقر المجلس الوطني الفلسطيني باعتباره السلطة العليا لمنظمة التحرير الفلسطينية، خلال دورته العادية يوم السابع عشر من نيسان/أبريل، يومًا وطنيًا للوفاء للأسرى الفلسطينيين وتضحياتهم، باعتباره يوماً لشحذ الهمم وتوحيد الجهود، لنصرتهم ومساندتهم ودعم حقهم بالحرية، ولتكريمهم وللوقوف بجانبهم وبجانب ذويهم، وأيضاً بهدف إثبات الوفاء لشهداء الحركة الأسيرة.ومنذ ذلك التاريخ حتى اليوم يتم إحياء هذا اليوم من كل عام، حيثُ يحيه الشعب الفلسطيني في فلسطين والشتات سنويًا بوسائل وأشكال متعددة."));
        return models;
    }

    private void setupNewsAdapter(ArrayList<News> models) {
        NewsAdapter adapter = new NewsAdapter(models);
        binding.newsRecyclerView.setAdapter(adapter);
        binding.newsRecyclerView.setLayoutManager(new LinearLayoutManager(this));
        binding.newsRecyclerView.setHasFixedSize(true);
    }

    private void setupListeners() {
        binding.floatAddNews.setOnClickListener(view ->
                startActivity(new Intent(NewsActivity.this, AddNewsActivity.class))
        );
    }

}